// Regular Expression

// i -> insensitive
// g -> global
//  ? -> match 0 or 1 of the preceding token
// * -> match 0 or more of the preceding token
// + -> match 1 or more of the preceding token
// {} -> range of count {n} {n,} {n,g}
// , -> match any character except line break


// .— নতুন লাইন ছাড়া সব ধরনের ক্যারেক্টার একটা একটা করে সিলেক্ট করার জন্যেঃ
// \w — ওয়ার্ড ক্যারেক্টার a-z, A-Z এবং 0–9 সহ _(আন্ডারস্কোর) ম্যাচ করতে ব্যবহার করা হয়ঃ
// \W — ওয়ার্ড ক্যারেক্টারগুলো ছাড়া বাকী সব ম্যাচ করতে ব্যবহার করা হয়ঃ
// \d — এটা ডিজিট ম্যাচ করার জন্যে ইউজ করা হয়ঃ
// \D — এটা ডিজিট ছাড়া বাকি সব ম্যাচ করানোর জন্যেঃ
// \s — যতরকমের White space আছে যেমন স্পেস, ট্যাব বা নিউলাইন ম্যাচ করার জন্যে ইউজ করা হয়ঃ
// \S — যেগুলো White space এর মধ্যে পড়ে না ঐধরনের ক্যারেক্টার ম্যাচ করার জন্যে ইউজ করা হয়ঃ
// \b — একটা ওয়ার্ডের শুরুর বা শেষের কোনো ক্যারেক্টার ম্যাচ করানো জন্যে/ যেমন আমাদের উপরের টেক্সট টাতে দ্বিতীয় ওয়ার্ড a দিয়ে শুরু হয়েছেঃ
//     \B — আগেরটার উল্টো, কোনো ওয়ার্ডের শুরুতে বা শেষে নাই এমনকিছু ম্যাচ করানোর জন্যে ব্যবহার করা হয়।
// \0 — নাল ক্যারেক্টার ম্যাচ করানোর জন্যে ব্যবহৃত হয়।
// \n — নিউ লাইন ক্যারেক্টার ম্যাচ করানোর জন্যে ব্যবহৃত হয়
